app/controllers/organizations/sessions_controller.rb

  def find_tenant_by_subdomain
    if (subdomain = request.subdomain)
      ActsAsTenant.current_tenant = Organization.where(subdomain: subdomain.downcase).first
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."subdomain" = $1 ORDER BY "organizations"."id" ASC LIMIT $2  [["subdomain", ""], ["LIMIT", 1]]